garyPenhook/PIC-Assembler/edc/PIC18F25Q24.PIC
        <edc:SFRDef edc:access="--rr--nn" edc:cname="VREGCON" edc:desc="" edc:impl="0x33" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--qq--10" edc:name="VREGCON" edc:nzwidth="8" edc:por="--qq--10" edc:_addr="0x48">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VREGPM" edc:mask="0x3" edc:name="VREGPM" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PMSYS" edc:mask="0x3" edc:name="PMSYS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="VREGPM0" edc:mask="0x1" edc:name="VREGPM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VREGPM1" edc:mask="0x1" edc:name="VREGPM0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PMSYS0" edc:mask="0x1" edc:name="PMSYS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMSYS1" edc:mask="0x1" edc:name="PMSYS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n------r" edc:cname="BORCON" edc:desc="" edc:impl="0x81" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u------u" edc:name="BORCON" edc:nzwidth="8" edc:por="1------q" edc:_addr="0x49">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BORRDY" edc:mask="0x1" edc:name="BORRDY" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="SBOREN" edc:mask="0x1" edc:name="SBOREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rr--nn" edc:cname="HLVDCON0" edc:desc="" edc:impl="0xb3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-xx--00" edc:name="HLVDCON0" edc:nzwidth="8" edc:por="0-xx--00" edc:_modsrc="DOS-02611_lvd_ctrl_v6_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x4A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTL" edc:mask="0x1" edc:name="INTL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTH" edc:mask="0x1" edc:name="INTH" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="RDY" edc:mask="0x1" edc:name="RDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:mask="0x1" edc:name="OUT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="HLVDINTL" edc:mask="0x1" edc:name="HLVDINTL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDINTH" edc:mask="0x1" edc:name="HLVDINTH" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="HLVDRDY" edc:mask="0x1" edc:name="HLVDRDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDOUT" edc:mask="0x1" edc:name="HLVDOUT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDEN" edc:mask="0x1" edc:name="HLVDEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="HLVDCON1" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="HLVDCON1" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02611_lvd_ctrl_v6_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x4B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEL" edc:mask="0xf" edc:name="SEL" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SEL0" edc:mask="0x1" edc:name="SEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEL1" edc:mask="0x1" edc:name="SEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEL2" edc:mask="0x1" edc:name="SEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEL3" edc:mask="0x1" edc:name="SEL0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="HLVDSEL0" edc:mask="0x1" edc:name="HLVDSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDSEL1" edc:mask="0x1" edc:name="HLVDSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDSEL2" edc:mask="0x1" edc:name="HLVDSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDSEL3" edc:mask="0x1" edc:name="HLVDSEL0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rn--nn" edc:cname="ZCD1CON" edc:desc="" edc:impl="0xb3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-x0--00" edc:name="ZCD1CON" edc:nzwidth="8" edc:por="0-x0--00" edc:_modsrc="DOS-02393_cmp_zxover_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1" edc:_addr="0x4C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ZCD1INTN" edc:desc="" edc:mask="0x1" edc:name="ZCD1INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ZCD1INTP" edc:desc="" edc:mask="0x1" edc:name="ZCD1INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ZCD1POL" edc:desc="" edc:mask="0x1" edc:name="ZCD1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ZCD1OUT" edc:desc="" edc:mask="0x1" edc:name="ZCD1OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ZCD1EN" edc:desc="" edc:mask="0x1" edc:name="ZCD1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rn--nn" edc:cname="ZCD2CON" edc:desc="" edc:impl="0xb3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-x0--00" edc:name="ZCD2CON" edc:nzwidth="8" edc:por="0-x0--00" edc:_modsrc="DOS-02393_cmp_zxover_ctrl_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x1" edc:_addr="0x4D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ZCD2INTN" edc:desc="" edc:mask="0x1" edc:name="ZCD2INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ZCD2INTP" edc:desc="" edc:mask="0x1" edc:name="ZCD2INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ZCD2POL" edc:desc="" edc:mask="0x1" edc:name="ZCD2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ZCD2OUT" edc:desc="" edc:mask="0x1" edc:name="ZCD2OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ZCD2EN" edc:desc="" edc:mask="0x1" edc:name="ZCD2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x4E"/>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="PMD0" edc:desc="" edc:impl="0x20" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-00" edc:name="PMD0" edc:nzwidth="8" edc:por="00000-00" edc:_modsrc="DOS-03793_pmd_mid8_v2_Q24.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x62">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCMD" edc:desc="" edc:mask="0x1" edc:name="IOCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRMD" edc:desc="" edc:mask="0x1" edc:name="CLKRMD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SCANMD" edc:desc="" edc:mask="0x1" edc:name="SCANMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCMD" edc:desc="" edc:mask="0x1" edc:name="CRCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HLVDMD" edc:mask="0x1" edc:name="HLVDMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FVRMD" edc:desc="" edc:mask="0x1" edc:name="FVRMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYSCMD" edc:desc="" edc:mask="0x1" edc:name="SYSCMD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="LVDMD" edc:mask="0x1" edc:name="LVDMD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMD1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03793_pmd_mid8_v2_Q24.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x63">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR0MD" edc:desc="" edc:mask="0x1" edc:name="TMR0MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR1MD" edc:desc="" edc:mask="0x1" edc:name="TMR1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR2MD" edc:desc="" edc:mask="0x1" edc:name="TMR2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3MD" edc:desc="" edc:mask="0x1" edc:name="TMR3MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR4MD" edc:desc="" edc:mask="0x1" edc:name="TMR4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR6MD" edc:desc="" edc:mask="0x1" edc:name="TMR6MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ZCD1MD" edc:desc="" edc:mask="0x1" edc:name="ZCD1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CM1MD" edc:desc="" edc:mask="0x1" edc:name="CM1MD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD2" edc:desc="" edc:impl="0xbe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMD2" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03793_pmd_mid8_v2_Q24.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x64">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CM2MD" edc:desc="" edc:mask="0x1" edc:name="CM2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCMD" edc:desc="" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1MD" edc:desc="" edc:mask="0x1" edc:name="DAC1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACTMD" edc:mask="0x1" edc:name="ACTMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1MD" edc:mask="0x1" edc:name="NCO1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1MD" edc:mask="0x1" edc:name="CWG1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1MD" edc:desc="" edc:mask="0x1" edc:name="CCP1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2MD" edc:mask="0x1" edc:name="CCP2MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMD3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03793_pmd_mid8_v2_Q24.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x65">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM1MD" edc:desc="" edc:mask="0x1" edc:name="PWM1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2MD" edc:desc="" edc:mask="0x1" edc:name="PWM2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3MD" edc:desc="" edc:mask="0x1" edc:name="PWM3MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="I2C1MD" edc:desc="" edc:mask="0x1" edc:name="I2C1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPI1MD" edc:desc="" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPI2MD" edc:mask="0x1" edc:name="SPI2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1MD" edc:desc="" edc:mask="0x1" edc:name="U1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2MD" edc:mask="0x1" edc:name="U2MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD4" edc:desc="" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMD4" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03793_pmd_mid8_v2_Q24.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x66">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I2C2MD" edc:mask="0x1" edc:name="I2C2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC1MD" edc:desc="" edc:mask="0x1" edc:name="CLC1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC2MD" edc:desc="" edc:mask="0x1" edc:name="CLC2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC3MD" edc:mask="0x1" edc:name="CLC3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC4MD" edc:desc="" edc:mask="0x1" edc:name="CLC4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DMA1MD" edc:desc="" edc:mask="0x1" edc:name="DMA1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DMA2MD" edc:desc="" edc:mask="0x1" edc:name="DMA2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DMA3MD" edc:mask="0x1" edc:name="DMA3MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD5" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMD5" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03793_pmd_mid8_v2_Q24.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x67">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ZCD2MD" edc:desc="" edc:mask="0x1" edc:name="ZCD2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU16AMD" edc:desc="" edc:mask="0x1" edc:name="TU16AMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU16BMD" edc:desc="" edc:mask="0x1" edc:name="TU16BMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DMA4MD" edc:desc="" edc:mask="0x1" edc:name="DMA4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC5MD" edc:mask="0x1" edc:name="CLC5MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC6MD" edc:mask="0x1" edc:name="CLC6MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC7MD" edc:mask="0x1" edc:name="CLC7MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC8MD" edc:mask="0x1" edc:name="CLC8MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------n" edc:cname="PMD6" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PMD6" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-03793_pmd_mid8_v2_Q24.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x68">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PORTWMD" edc:mask="0x1" edc:name="PORTWMD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:AdjustPoint edc:offset="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x6" edc:_addr="0x69"/>
        <edc:SFRDef edc:access="------rr" edc:cname="CMOUT" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CMOUT" edc:nzwidth="8" edc:por="------00" edc:_addr="0x6F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MC1OUT" edc:mask="0x1" edc:name="MC1OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MC2OUT" edc:mask="0x1" edc:name="MC2OUT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
