garyPenhook/PIC-Assembler/edc/PIC18F25Q24.PIC
        <edc:SFRDef edc:access="nnnn-nn-" edc:cname="SPI2INTE" edc:desc="" edc:impl="0xf6" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-00-" edc:name="SPI2INTE" edc:nzwidth="8" edc:por="0000-00-" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x98">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXUIE" edc:mask="0x1" edc:name="TXUIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOIE" edc:mask="0x1" edc:name="RXOIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="EOSIE" edc:mask="0x1" edc:name="EOSIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SOSIE" edc:mask="0x1" edc:name="SOSIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCZIE" edc:mask="0x1" edc:name="TCZIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRMTIE" edc:mask="0x1" edc:name="SRMTIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2TXUIE" edc:mask="0x1" edc:name="SPI2TXUIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2RXOIE" edc:mask="0x1" edc:name="SPI2RXOIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2EOSIE" edc:mask="0x1" edc:name="SPI2EOSIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SOSIE" edc:mask="0x1" edc:name="SPI2SOSIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2TCZIE" edc:mask="0x1" edc:name="SPI2TCZIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SRMTIE" edc:mask="0x1" edc:name="SPI2SRMTIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SPI2CLK" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="SPI2CLK" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x99">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLKSEL" edc:mask="0x1f" edc:name="CLKSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLKSEL0" edc:mask="0x1" edc:name="CLKSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKSEL1" edc:mask="0x1" edc:name="CLKSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKSEL2" edc:mask="0x1" edc:name="CLKSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKSEL3" edc:mask="0x1" edc:name="CLKSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKSEL4" edc:mask="0x1" edc:name="CLKSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI2CLKSEL" edc:mask="0x1f" edc:name="SPI2CLKSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SPI2CLKSEL0" edc:mask="0x1" edc:name="SPI2CLKSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2CLKSEL1" edc:mask="0x1" edc:name="SPI2CLKSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2CLKSEL2" edc:mask="0x1" edc:name="SPI2CLKSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2CLKSEL3" edc:mask="0x1" edc:name="SPI2CLKSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2CLKSEL4" edc:mask="0x1" edc:name="SPI2CLKSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x12" edc:_addr="0x9A"/>
        <edc:SFRDef edc:access="nn--r-r-" edc:cname="ACTCON" edc:desc="" edc:impl="0xca" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0-0-" edc:name="ACTCON" edc:nzwidth="8" edc:por="00--0-0-" edc:_addr="0xAC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ORS" edc:mask="0x1" edc:name="ORS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="LOCK" edc:mask="0x1" edc:name="LOCK" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="UD" edc:mask="0x1" edc:name="UD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTORS" edc:mask="0x1" edc:name="ACTORS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTLOCK" edc:mask="0x1" edc:name="ACTLOCK" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="ACTUD" edc:mask="0x1" edc:name="ACTUD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTEN" edc:mask="0x1" edc:name="ACTEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="OSCCON1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="OSCCON1" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0xAD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NDIV" edc:mask="0xf" edc:name="NDIV" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="NOSC" edc:mask="0x7" edc:name="NOSC" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NDIV0" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV1" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV2" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV3" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC0" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC1" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC2" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrrrrrr" edc:cname="OSCCON2" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="OSCCON2" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0xAE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CDIV" edc:mask="0xf" edc:name="CDIV" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="COSC" edc:mask="0x7" edc:name="COSC" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CDIV0" edc:mask="0x1" edc:name="CDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CDIV1" edc:mask="0x1" edc:name="CDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CDIV2" edc:mask="0x1" edc:name="CDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CDIV3" edc:mask="0x1" edc:name="CDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COSC0" edc:mask="0x1" edc:name="COSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COSC1" edc:mask="0x1" edc:name="COSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COSC2" edc:mask="0x1" edc:name="COSC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
