garyPenhook/PIC-Assembler/edc/PIC18F25Q24.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RC0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RC0PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x211">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC0PPS0" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS1" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS2" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS3" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS4" edc:mask="0x1" edc:name="RC0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS5" edc:mask="0x1" edc:name="RC0PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RC1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RC1PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x212">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC1PPS0" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS1" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS2" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS3" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS4" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS5" edc:mask="0x1" edc:name="RC1PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RC2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RC2PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x213">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC2PPS0" edc:mask="0x1" edc:name="RC2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2PPS1" edc:mask="0x1" edc:name="RC2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2PPS2" edc:mask="0x1" edc:name="RC2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2PPS3" edc:mask="0x1" edc:name="RC2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2PPS4" edc:mask="0x1" edc:name="RC2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2PPS5" edc:mask="0x1" edc:name="RC2PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RC3PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RC3PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x214">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC3PPS0" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS1" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS2" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS3" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS4" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS5" edc:mask="0x1" edc:name="RC3PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RC4PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RC4PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x215">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC4PPS0" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS1" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS2" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS3" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS4" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS5" edc:mask="0x1" edc:name="RC4PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RC5PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RC5PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x216">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC5PPS0" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS1" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS2" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS3" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS4" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS5" edc:mask="0x1" edc:name="RC5PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RC6PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RC6PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x217">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC6PPS0" edc:mask="0x1" edc:name="RC6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6PPS1" edc:mask="0x1" edc:name="RC6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6PPS2" edc:mask="0x1" edc:name="RC6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6PPS3" edc:mask="0x1" edc:name="RC6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6PPS4" edc:mask="0x1" edc:name="RC6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6PPS5" edc:mask="0x1" edc:name="RC6PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RC7PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RC7PPS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x218">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC7PPS0" edc:mask="0x1" edc:name="RC7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7PPS1" edc:mask="0x1" edc:name="RC7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7PPS2" edc:mask="0x1" edc:name="RC7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7PPS3" edc:mask="0x1" edc:name="RC7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7PPS4" edc:mask="0x1" edc:name="RC7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7PPS5" edc:mask="0x1" edc:name="RC7PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7PPS6" edc:mask="0x1" edc:name="RC7PPS6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7PPS7" edc:mask="0x1" edc:name="RC7PPS7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x25" edc:_addr="0x219"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INT0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="INT0PPS" edc:nzwidth="8" edc:por="--001000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x23E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT0PPS0" edc:mask="0x1" edc:name="INT0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS1" edc:mask="0x1" edc:name="INT0PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS2" edc:mask="0x1" edc:name="INT0PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS3" edc:mask="0x1" edc:name="INT0PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS4" edc:mask="0x1" edc:name="INT0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS5" edc:mask="0x1" edc:name="INT0PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="INT0PPS" edc:mask="0x3f" edc:name="INT0PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INT1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="INT1PPS" edc:nzwidth="8" edc:por="--001001" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x23F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT1PPS0" edc:mask="0x1" edc:name="INT1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS1" edc:mask="0x1" edc:name="INT1PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS2" edc:mask="0x1" edc:name="INT1PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS3" edc:mask="0x1" edc:name="INT1PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS4" edc:mask="0x1" edc:name="INT1PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS5" edc:mask="0x1" edc:name="INT1PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="INT1PPS" edc:mask="0x3f" edc:name="INT1PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INT2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="INT2PPS" edc:nzwidth="8" edc:por="--001010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x240">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT2PPS0" edc:mask="0x1" edc:name="INT2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS1" edc:mask="0x1" edc:name="INT2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS2" edc:mask="0x1" edc:name="INT2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS3" edc:mask="0x1" edc:name="INT2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS4" edc:mask="0x1" edc:name="INT2PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS5" edc:mask="0x1" edc:name="INT2PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="INT2PPS" edc:mask="0x3f" edc:name="INT2PPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T0CKIPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T0CKIPPS" edc:nzwidth="8" edc:por="--000100" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x241">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T0CKIPPS" edc:mask="0x3f" edc:name="T0CKIPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T0CKIPPS0" edc:mask="0x1" edc:name="T0CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS1" edc:mask="0x1" edc:name="T0CKIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS2" edc:mask="0x1" edc:name="T0CKIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS3" edc:mask="0x1" edc:name="T0CKIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS4" edc:mask="0x1" edc:name="T0CKIPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS5" edc:mask="0x1" edc:name="T0CKIPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T1CKIPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T1CKIPPS" edc:nzwidth="8" edc:por="--010000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x42" edc:_addr="0x242">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T1CKIPPS0" edc:mask="0x1" edc:name="T1CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS1" edc:mask="0x1" edc:name="T1CKIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS2" edc:mask="0x1" edc:name="T1CKIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS3" edc:mask="0x1" edc:name="T1CKIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS4" edc:mask="0x1" edc:name="T1CKIPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS5" edc:mask="0x1" edc:name="T1CKIPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T1CKIPPS" edc:mask="0x3f" edc:name="T1CKIPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
